p4/StepOutYourDoor/app/controllers/experiences_controller.rb

SELECT "experiences".* FROM "experiences"
---
  def index
    @experiences = Experience.all

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "experiences" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-04-13 16:09:11.867286"], ["updated_at", "2020-04-13 16:09:11.867286"]]
INSERT INTO "experiences" ("name", "location", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Empire State Building"], ["location", "New York City"], ["description", "Went sightseeing."], ["created_at", "2020-04-09 00:08:47.857580"], ["updated_at", "2020-04-09 00:08:47.857580"]]
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @experience = Experience.new(experience_params)
    @user = User.find(params[:id])
    if @experience.save!
      @experience.users << @user

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "experiences" WHERE "experiences"."id" = $1  [["id", 11]]
---
  def delete
    @experience = Experience.find(params[:id])
    puts @experience, "HEY"
    @experience.destroy

SELECT "experiences".* FROM "experiences" WHERE "experiences"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
---
def set_experience
  @experience = Experience.find(params[:id])