p4/StepOutYourDoor/app/controllers/users_controller.rb

UPDATE "users" SET "name" = $1, "avatar" = $2, "email" = $3, "password_digest" = $4, "updated_at" = $5 WHERE "users"."id" = $6
---
  def update
    if @user.update(user_params)